#!/usr/bin/python3
# -*- coding: utf-8 -*-
# @Time : 2021/1/12 9:38
# @Author : ZY
# @File : Demo04_字典.py
# @Project : code
"""
    字典（dict):以大括号为边界，以逗号隔开的键值对
    特点：
        1，有序的（3.6版本之前（不包括3.6）是无序的）
        2，可变的
        3，键必须是 不可变 ，值随便
        4，键名不能重复，重复的话后面的值覆盖之前的值
        5，空字典用{}
"""

# 键名不能重复，重复的话后面的值覆盖之前的值
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# print(a)  # {'a': [9, 10, 11], 'c': [4, 5, 6], 'b': [6, 7, 8]}

# 查看数据
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# print(a['a'])  # [1, 2, 3]

# 修改数据
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# a['a'] = '周宇'  # 有这个键就改数据
# print(a)  # {'a': '周宇', 'c': [4, 5, 6], 'b': [6, 7, 8]}
# a['txt和Excel互相转换'] = 'yyy'  # 没有这个键就新增一个
# print(a)

# 删除字典中的数据
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# del a['a']
# print(a)  # {'c': [4, 5, 6], 'b': [6, 7, 8]}

# 删除字典
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# del a
# print(a)  # 报错

# 清空字典
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# a.clear()
# print(a)

# 查
# get(key,默认值) 如果当前查找的key不存在则返回第二个参数(默认值)，如果省略第二个参数，则返回None。
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# print('a')  # 找不到会报错
# print(a.get('bbbbb'))
# print(a.get('bbbbb', 1))

# keys() 以列表显示所有的键
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# b = a.keys()
# print(b)

# values() 以列表显示所有的值
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# b = a.values()
# print(b)

# items() 以列表显示所有的值
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# b = a.items()
# print(b)

# b = [('a', 1), ('b', 2), ('c', 3)]
# for i, j in b:
#     print(i, j)
'''
    a 1
    b 2
    c 3
'''
# a = {'a': [1, 2, 3], 'c': [4, 5, 6], 'b': [6, 7, 8]}
# for i, j in a.items():
#     print(i, j)
'''
    a [1, 2, 3]
    c [4, 5, 6]
    b [6, 7, 8]
'''

